# config.py

# =================================================================
# الإعدادات الأساسية
# =================================================================

# config.py

# =================================================================
# الإعدادات الأساسية
# =================================================================

# اسم نموذج Swin Transformer المتخصص (بدلاً من CLIP)
MODEL_NAME = "microsoft/swin-tiny-patch4-window7-224" # <-- تم التعديل هنا

# اسم قاعدة بيانات SQLite
DB_NAME = "heart_embeddings_swin.db" # <-- قمنا بتغيير اسم القاعدة لتجنب التداخل

# اسم الجدول داخل قاعدة البيانات
TABLE_NAME = "heart_cases_swin"

# المجلد الرئيسي الذي يحتوي على مجلدات التصنيفات (normal, grade1,...)
BASE_DIR = r"D:\Grading" 

# اسم ملف البيانات الحيوية (Excel)
EXCEL_PATH = r"D:\cases.xlsx" 

